docs/architecture/diagrams/mermaid/structurizr-Components_gateway.mmd
graph TB
  linkStyle default fill:#ffffff

  subgraph diagram ["archlette-demo - gateway - Components"]
    style diagram fill:#ffffff,stroke:#ffffff

    subgraph 25 ["gateway"]
      style 25 fill:#ffffff,stroke:#ac5b15,color:#ac5b15

      26("<div style='font-weight: bold'>auth</div><div style='font-size: 70%; margin-top: 0px'>[Component: module]</div><div style='font-size: 80%; margin-top:10px'>Authentication and token<br />minting</div>")
      style 26 fill:#85bbf0,stroke:#5d82a8,color:#000000
      27("<div style='font-weight: bold'>env</div><div style='font-size: 70%; margin-top: 0px'>[Component: module]</div><div style='font-size: 80%; margin-top:10px'>Environment bindings for<br />Gateway Worker</div>")
      style 27 fill:#85bbf0,stroke:#5d82a8,color:#000000
      28("<div style='font-weight: bold'>main</div><div style='font-size: 70%; margin-top: 0px'>[Component: module]</div><div style='font-size: 80%; margin-top:10px'>Flarelette Gateway Entry<br />point for all API traffic.<br />Routes requests to<br />microservices with internal<br />JWT authentication (EdDSA<br />signed). All input is<br />validated with Zod - zero<br />trust!</div>")
      style 28 fill:#85bbf0,stroke:#5d82a8,color:#000000
      29("<div style='font-weight: bold'>validation</div><div style='font-size: 70%; margin-top: 0px'>[Component: module]</div><div style='font-size: 80%; margin-top:10px'>Input validation schemas<br />using Zod All input is<br />validated - zero trust!</div>")
      style 29 fill:#85bbf0,stroke:#5d82a8,color:#000000
    end

    28-- "<div>imports Env</div><div style='font-size: 70%'></div>" -->27
    28-- "<div>imports<br />getOrMintInternalToken</div><div style='font-size: 70%'></div>" -->26
  end
